---
kind: method
id: M:Autodesk.Revit.DB.ExportFontInfo.#ctor(Autodesk.Revit.DB.ExportFontInfo)
source: html/c07fc8f9-0668-f81a-a095-c2fc7a889844.htm
---
# Autodesk.Revit.DB.ExportFontInfo.#ctor Method

Constructs a new copy of the input ExportFontInfo object.

## Syntax (C#)
```csharp
public ExportFontInfo(
	ExportFontInfo other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExportFontInfo`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null